# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeIterator..::..Reset Method
DuctSizeIterator Class See Also
---
Resets the iterator to the initial state.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace